sysbenchOutputs_small/results_12_1G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 12
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 51.2MiB each
1024MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      299.22
    writes/s:                     199.59
    fsyncs/s:                     107.19

Throughput:
    read, MiB/s:                  4.67
    written, MiB/s:               3.12

General statistics:
    total time:                          30.2688s
    total number of events:              18105

Latency (ms):
         min:                                    0.01
         avg:                                   19.95
         max:                                  333.65
         95th percentile:                      139.85
         sum:                               361107.79

Threads fairness:
    events (avg/stddev):           1508.7500/178.90
    execution time (avg/stddev):   30.0923/0.00