sysbenchOutputs_small/results_15_2G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 15
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 102.4MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      294.65
    writes/s:                     196.60
    fsyncs/s:                     108.11

Throughput:
    read, MiB/s:                  4.60
    written, MiB/s:               3.07

General statistics:
    total time:                          30.1243s
    total number of events:              17757

Latency (ms):
         min:                                    0.00
         avg:                                   25.40
         max:                                  395.71
         95th percentile:                      179.94
         sum:                               450940.33

Threads fairness:
    events (avg/stddev):           1183.8000/202.08
    execution time (avg/stddev):   30.0627/0.00