sysbenchOutputs_small/results_15_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 15
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 25MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      314.04
    writes/s:                     209.36
    fsyncs/s:                     114.19

Throughput:
    read, MiB/s:                  4.91
    written, MiB/s:               3.27

General statistics:
    total time:                          30.1843s
    total number of events:              18947

Latency (ms):
         min:                                    0.00
         avg:                                   23.77
         max:                                  349.63
         95th percentile:                      167.44
         sum:                               450339.78

Threads fairness:
    events (avg/stddev):           1263.1333/103.07
    execution time (avg/stddev):   30.0227/0.01