sysbenchOutputs_small/results_18_2G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 18
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 102.4MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      307.98
    writes/s:                     205.43
    fsyncs/s:                     114.34

Throughput:
    read, MiB/s:                  4.81
    written, MiB/s:               3.21

General statistics:
    total time:                          30.1868s
    total number of events:              18592

Latency (ms):
         min:                                    0.01
         avg:                                   29.11
         max:                                  425.44
         95th percentile:                      196.89
         sum:                               541213.46

Threads fairness:
    events (avg/stddev):           1032.8889/86.17
    execution time (avg/stddev):   30.0674/0.06