sysbenchOutputs_small/results_19_100M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 19
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 5MiB each
100MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      353.88
    writes/s:                     236.47
    fsyncs/s:                     130.64

Throughput:
    read, MiB/s:                  5.53
    written, MiB/s:               3.69

General statistics:
    total time:                          30.1484s
    total number of events:              21359

Latency (ms):
         min:                                    0.00
         avg:                                   26.75
         max:                                  416.88
         95th percentile:                      176.73
         sum:                               571359.66

Threads fairness:
    events (avg/stddev):           1124.1579/97.36
    execution time (avg/stddev):   30.0716/0.01