sysbenchOutputs_small/results_20_100M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 5MiB each
100MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      367.38
    writes/s:                     245.09
    fsyncs/s:                     135.24

Throughput:
    read, MiB/s:                  5.74
    written, MiB/s:               3.83

General statistics:
    total time:                          30.3654s
    total number of events:              22307

Latency (ms):
         min:                                    0.00
         avg:                                   26.93
         max:                                  355.25
         95th percentile:                      176.73
         sum:                               600666.06

Threads fairness:
    events (avg/stddev):           1115.3500/151.74
    execution time (avg/stddev):   30.0333/0.03