sysbenchOutputs_small/results_23_1G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 23
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 51.2MiB each
1024MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      330.82
    writes/s:                     220.55
    fsyncs/s:                     125.52

Throughput:
    read, MiB/s:                  5.17
    written, MiB/s:               3.45

General statistics:
    total time:                          30.1037s
    total number of events:              19919

Latency (ms):
         min:                                    0.00
         avg:                                   34.69
         max:                                  484.93
         95th percentile:                      227.40
         sum:                               691016.44

Threads fairness:
    events (avg/stddev):           866.0435/133.04
    execution time (avg/stddev):   30.0442/0.00