sysbenchOutputs_small/results_24_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 24
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 25MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      337.80
    writes/s:                     225.20
    fsyncs/s:                     127.78

Throughput:
    read, MiB/s:                  5.28
    written, MiB/s:               3.52

General statistics:
    total time:                          30.3693s
    total number of events:              20501

Latency (ms):
         min:                                    0.00
         avg:                                   35.28
         max:                                  448.87
         95th percentile:                      240.02
         sum:                               723180.61

Threads fairness:
    events (avg/stddev):           854.2083/135.22
    execution time (avg/stddev):   30.1325/0.01