sysbenchOutputs_small/results_25_1G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 25
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 51.2MiB each
1024MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      321.73
    writes/s:                     214.48
    fsyncs/s:                     123.10

Throughput:
    read, MiB/s:                  5.03
    written, MiB/s:               3.35

General statistics:
    total time:                          30.3953s
    total number of events:              19542

Latency (ms):
         min:                                    0.00
         avg:                                   38.52
         max:                                  557.93
         95th percentile:                      257.95
         sum:                               752687.81

Threads fairness:
    events (avg/stddev):           781.6800/106.92
    execution time (avg/stddev):   30.1075/0.01