sysbenchOutputs_small/results_26_1G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 26
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 51.2MiB each
1024MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      328.39
    writes/s:                     218.87
    fsyncs/s:                     126.70

Throughput:
    read, MiB/s:                  5.13
    written, MiB/s:               3.42

General statistics:
    total time:                          30.1471s
    total number of events:              19800

Latency (ms):
         min:                                    0.00
         avg:                                   39.56
         max:                                  509.04
         95th percentile:                      282.25
         sum:                               783346.40

Threads fairness:
    events (avg/stddev):           761.5385/126.40
    execution time (avg/stddev):   30.1287/0.03